In [1]:
import sqlite3 as sq3
import pandas as pd

In [2]:
from datetime import datetime
def log(message):
    timestamp_format = '%Y-%h-%d-%H:%M:%S'
    now = datetime.now()
    timestamp = now.strftime(timestamp_format)
    with open("logfile.txt",'a') as f:
        f.write(timestamp+','+message+'\n')

In [3]:
con = sq3.connect("movies_database.db")

### Create Database dan Tabel

In [116]:
#Tabel sudah dibuat dan dimasukan ke dalam database pada fase Load

# movies.to_sql("Movies", con, index = False)
# votes.to_sql("Votes", con, index = False)
# genres.to_sql("Genres", con, index = False)
# prod.to_sql("Prod", con, index = False)

In [115]:
con.execute("Select * FROM sqlite_master").fetchall()

[('table',
  'Movies',
  'Movies',
  2,
  'CREATE TABLE "Movies" (\n"id" INTEGER,\n  "title" TEXT,\n  "revenue" REAL,\n  "budget" REAL,\n  "belongs_to_collection_name" TEXT,\n  "release_date" TIMESTAMP\n)'),
 ('table',
  'Votes',
  'Votes',
  17,
  'CREATE TABLE "Votes" (\n"id" INTEGER,\n  "vote_count" INTEGER,\n  "vote_average" REAL\n)'),
 ('table',
  'Genres',
  'Genres',
  21,
  'CREATE TABLE "Genres" (\n"genre_id" INTEGER,\n  "genre_name" TEXT,\n  "id" INTEGER\n)'),
 ('table',
  'Prod',
  'Prod',
  34,
  'CREATE TABLE "Prod" (\n"comp_id" INTEGER,\n  "comp_logo_path" TEXT,\n  "comp_name" TEXT,\n  "comp_origin_country" TEXT,\n  "id" INTEGER\n)')]

### Melihat tabel yang ada dalam database

In [117]:
con.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name").fetchall()

[('Genres',), ('Movies',), ('Prod',), ('Votes',)]

### **1.INSERT (3 row baru) pada tabel Movies,genres,dan Prod**

In [27]:
log("Melakukan proses Query")

#### `Tabel Movies`

In [28]:
log("INSERT (3 row baru) pada tabel Movies")

In [48]:
pd.read_sql("SELECT * FROM Movies ", con).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 983 entries, 0 to 982
Data columns (total 6 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   id                          983 non-null    int64
 1   title                       983 non-null    object
 2   revenue                     603 non-null    float64
 3   budget                      603 non-null    float64
 4   belongs_to_collection_name  84 non-null     object
 5   release_date                983 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 46.2+ KB

In [38]:
con.execute("INSERT INTO Movies \
            values(1,'Venom 3',1500.88,250,'Sony Enterprise','2018-05-12 00:00:00')")

con.execute("INSERT INTO Movies \
            values(2,'Hulk 3',2100.78,350,'Marvel Studios','2019-03-11 00:00:00')")

con.execute("INSERT INTO Movies \
            values(3,'Black Panther 3',1300.44,110,'Disney Enterprise','2019-01-10 00:00:00')")

con.commit()

In [42]:
pd.read_sql("SELECT * FROM Movies WHERE id>=1 AND id<=3", con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,1,Venom 3,1500.88,250.0,Sony Enterprise,2018-05-12 00:00:00
1,2,Hulk 3,2100.78,350.0,Marvel Studios,2019-03-11 00:00:00
2,3,Black Panther 3,1300.44,110.0,Disney Enterprise,2019-01-10 00:00:00

#### `Tabel genres`

In [11]:
log("INSERT (3 row baru) pada tabel genres")

In [4]:
pd.read_sql("SELECT * FROM genres", con).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2378 entries, 0 to 2377
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_id    2378 non-null   int64
 1   genre_name  2378 non-null   object
 2   id          2378 non-null   int64
dtypes: int64(2), object(1)
memory usage: 55.9+ KB

In [7]:
pd.read_sql("SELECT * FROM genres WHERE id=38700", con)

   genre_id genre_name     id
0        53   Thriller  38700
1        28     Action  38700
2        80      Crime  38700

In [8]:
con.execute("INSERT INTO genres \
            values(878,'Science Fiction',38700)")

con.execute("INSERT INTO genres \
            values(12,'Adventure',38700)")

con.execute("INSERT INTO genres \
            values(14,'Fantasy',38700)")

con.commit()

In [9]:
pd.read_sql("SELECT * FROM genres WHERE id=38700", con)

   genre_id       genre_name     id
0        53         Thriller  38700
1        28           Action  38700
2        80            Crime  38700
3       878  Science Fiction  38700
4        12        Adventure  38700
5        14          Fantasy  38700

#### `Tabel Prod`

In [14]:
log("INSERT (3 row baru) pada tabel Prod")

In [13]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   comp_id              3 non-null      int64
 1   comp_logo_path       1 non-null      object
 2   comp_name            3 non-null      object
 3   comp_origin_country  3 non-null      object
 4   id                   3 non-null      int64
dtypes: int64(2), object(3)
memory usage: 248.0+ bytes

In [12]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con)

,comp_id,comp_logo_path,comp_name,comp_origin_country,id
0,84792,None,2.0 Entertainment,US,38700
1,10288,None,Don Simpson/Jerry Bruckheimer Films,US,38700
2,907,/ca5SWI5uvU985f8Kbb4xc8AmVWH.png,Overbrook Entertainment,US,38700

In [15]:
con.execute("INSERT INTO Prod \
            values(139032,'None','Ouroboros Films','US',38700)")

con.execute("INSERT INTO Prod \
            values(146418,'None','Robert Fox and Jones','US',38700)")

con.execute("INSERT INTO Prod \
            values(146419,'None','Tintoretto Entertainment','US',38700)")

con.commit()

In [16]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con)

,comp_id,comp_logo_path,comp_name,comp_origin_country,id
0,84792,None,2.0 Entertainment,US,38700
1,10288,None,Don Simpson/Jerry Bruckheimer Films,US,38700
2,907,/ca5SWI5uvU985f8Kbb4xc8AmVWH.png,Overbrook Entertainment,US,38700
3,139032,None,Ouroboros Films,US,38700
4,146418,None,Robert Fox and Jones,US,38700
5,146419,None,Tintoretto Entertainment,US,38700

### **2.UPDATE (3 row) pada tabel Movies,genres,dan Prod**

#### `Tabel Movies`

In [22]:
log("UPDATE (3 row) pada tabel Movies")

In [18]:
pd.read_sql("SELECT * FROM Movies WHERE id>=1 AND id<=3", con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,1,Venom 3,1500.88,250.0,Sony Enterprise,2018-05-12 00:00:00
1,2,Hulk 3,2100.78,350.0,Marvel Studios,2019-03-11 00:00:00
2,3,Black Panther 3,1300.44,110.0,Disney Enterprise,2019-01-10 00:00:00

In [19]:
con.execute("UPDATE Movies \
           SET title = 'Venom 4'\
           WHERE id=1")

con.execute("UPDATE Movies \
           SET title = 'Hulk 4'\
           WHERE id=2")

con.execute("UPDATE Movies \
           SET title = 'Black Panther 4'\
           WHERE id=2")

con.commit()

In [20]:
pd.read_sql("SELECT * FROM Movies WHERE id>=1 AND id<=3", con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,1,Venom 4,1500.88,250.0,Sony Enterprise,2018-05-12 00:00:00
1,2,Black Panther 4,2100.78,350.0,Marvel Studios,2019-03-11 00:00:00
2,3,Black Panther 3,1300.44,110.0,Disney Enterprise,2019-01-10 00:00:00

#### `Tabel genres`

In [25]:
log("UPDATE (3 row) pada tabel genres")

In [21]:
pd.read_sql("SELECT * FROM genres WHERE id=38700", con)

   genre_id       genre_name     id
0        53         Thriller  38700
1        28           Action  38700
2        80            Crime  38700
3       878  Science Fiction  38700
4        12        Adventure  38700
5        14          Fantasy  38700

In [32]:
con.execute("UPDATE genres \
           SET genre_name = 'Comedy'\
           WHERE genre_id=53")

con.execute("UPDATE genres \
           SET genre_name = 'Horor'\
           WHERE genre_id=28")

con.execute("UPDATE genres \
           SET genre_name = 'Family'\
           WHERE genre_id=80")


con.commit()

In [33]:
pd.read_sql("SELECT * FROM genres WHERE id=38700", con)

   genre_id       genre_name     id
0        53           Comedy  38700
1        28            Horor  38700
2        80           Family  38700
3       878  Science Fiction  38700
4        12        Adventure  38700
5        14          Fantasy  38700

#### `Tabel prod`

In [38]:
log("UPDATE (3 row) pada tabel prod")

In [34]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con)

,comp_id,comp_logo_path,comp_name,comp_origin_country,id
0,84792,None,2.0 Entertainment,US,38700
1,10288,None,Don Simpson/Jerry Bruckheimer Films,US,38700
2,907,/ca5SWI5uvU985f8Kbb4xc8AmVWH.png,Overbrook Entertainment,US,38700
3,139032,None,Ouroboros Films,US,38700
4,146418,None,Robert Fox and Jones,US,38700
5,146419,None,Tintoretto Entertainment,US,38700

In [36]:
con.execute("UPDATE prod \
           SET comp_origin_country = 'JP'\
           WHERE comp_id=139032")

con.execute("UPDATE prod \
           SET comp_origin_country = 'ID'\
           WHERE comp_id=146418")

con.execute("UPDATE prod \
           SET comp_origin_country = 'NG'\
           WHERE comp_id=146419")


con.commit()

In [37]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con)

,comp_id,comp_logo_path,comp_name,comp_origin_country,id
0,84792,None,2.0 Entertainment,US,38700
1,10288,None,Don Simpson/Jerry Bruckheimer Films,US,38700
2,907,/ca5SWI5uvU985f8Kbb4xc8AmVWH.png,Overbrook Entertainment,US,38700
3,139032,None,Ouroboros Films,JP,38700
4,146418,None,Robert Fox and Jones,ID,38700
5,146419,None,Tintoretto Entertainment,NG,38700

### **3.Delete (3 row) pada tabel Movies,genres,dan Prod**

#### `Tabel Movies`

In [41]:
log("Delete (3 row) pada tabel Movies")

In [43]:
pd.read_sql("SELECT * FROM Movies WHERE id>=1 AND id<=3",con)

,id,title,revenue,budget,belongs_to_collection_name,release_date
0,1,Venom 4,1500.88,250.0,Sony Enterprise,2018-05-12 00:00:00
1,2,Black Panther 4,2100.78,350.0,Marvel Studios,2019-03-11 00:00:00
2,3,Black Panther 3,1300.44,110.0,Disney Enterprise,2019-01-10 00:00:00

In [44]:
con.execute("DELETE FROM Movies \
           WHERE id=1")

con.execute("DELETE FROM Movies \
           WHERE id=2")

con.execute("DELETE FROM Movies \
           WHERE id=3")


con.commit()

In [45]:
pd.read_sql("SELECT * FROM Movies WHERE id>=1 AND id<=3",con)

Empty DataFrame
Columns: [id, title, revenue, budget, belongs_to_collection_name, release_date]
Index: []

#### `Tabel genres`

In [47]:
log("Delete (3 row) pada tabel genres")

In [48]:
pd.read_sql("SELECT * FROM genres WHERE id=38700", con)

   genre_id       genre_name     id
0        53           Comedy  38700
1        28            Horor  38700
2        80           Family  38700
3       878  Science Fiction  38700
4        12        Adventure  38700
5        14          Fantasy  38700

In [49]:
con.execute("DELETE FROM genres \
           WHERE genre_id=53 AND id=38700")

con.execute("DELETE FROM genres \
           WHERE genre_id=28 AND id=38700")

con.execute("DELETE FROM genres \
           WHERE genre_id=80 AND id=38700")


con.commit()

In [50]:
pd.read_sql("SELECT * FROM genres WHERE id=38700", con)

   genre_id       genre_name     id
0       878  Science Fiction  38700
1        12        Adventure  38700
2        14          Fantasy  38700

#### `Tabel prod`

In [52]:
log("Delete (3 row) pada tabel prod")

In [51]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con)

,comp_id,comp_logo_path,comp_name,comp_origin_country,id
0,84792,None,2.0 Entertainment,US,38700
1,10288,None,Don Simpson/Jerry Bruckheimer Films,US,38700
2,907,/ca5SWI5uvU985f8Kbb4xc8AmVWH.png,Overbrook Entertainment,US,38700
3,139032,None,Ouroboros Films,JP,38700
4,146418,None,Robert Fox and Jones,ID,38700
5,146419,None,Tintoretto Entertainment,NG,38700

In [53]:
con.execute("DELETE FROM prod \
           WHERE comp_id=139032 AND id=38700")

con.execute("DELETE FROM prod \
           WHERE comp_id=146418 AND id=38700")

con.execute("DELETE FROM prod \
           WHERE comp_id=146419 AND id=38700")


con.commit()

In [54]:
pd.read_sql("SELECT * FROM prod WHERE id=38700", con)

,comp_id,comp_logo_path,comp_name,comp_origin_country,id
0,84792,None,2.0 Entertainment,US,38700
1,10288,None,Don Simpson/Jerry Bruckheimer Films,US,38700
2,907,/ca5SWI5uvU985f8Kbb4xc8AmVWH.png,Overbrook Entertainment,US,38700

### **4.Count Query pada tabel Movies**

In [55]:
log("3 contoh Count Query pada tabel Movies")

**`Tabel Movies`**

In [105]:
pd.read_sql("SELECT * FROM Movies WHERE id>=1 AND id<=3",con).info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 6 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   id                          0 non-null      object
 1   title                       0 non-null      object
 2   revenue                     0 non-null      object
 3   budget                      0 non-null      object
 4   belongs_to_collection_name  0 non-null      object
 5   release_date                0 non-null      object
dtypes: object(6)
memory usage: 0.0+ bytes

1. Mencari banyak judul film (DISNTINCT) pada tabel Movies

In [111]:
pd.read_sql("SELECT COUNT(DISTINCT title) as banyak_film FROM Movies",con)

   banyak_film
0          979

2. Mencari revenue terkecil pada tabel Movies berdasarkan kepemilikan film

In [114]:
pd.read_sql("SELECT min(revenue) as rev ,belongs_to_collection_name FROM Movies WHERE revenue>0 ",con)

        rev belongs_to_collection_name
0  0.000001                       None

2.1. Mencari 5 revenue terkecil pada tabel Movies berdasarkan kepemilikan film

In [107]:
pd.read_sql("SELECT min(revenue) as rev ,belongs_to_collection_name FROM Movies WHERE revenue>0 GROUP BY belongs_to_collection_name ORDER BY rev ASC LIMIT 5",con)

         rev                         belongs_to_collection_name
0   0.000001                                               None
1   0.526114  Code Geass: Lelouch of the Rebellion Recap Fil...
2   1.502605             Magical Girl Lyrical Nanoha Collection
3   3.501037                                G.O.R.A. Collection
4  28.646544                         Teen Titans Go! Collection

3. Mencari budget terbesar pada tabel Movies berdasarkan kepemilikan film

In [113]:
pd.read_sql("SELECT max(budget) as budget,belongs_to_collection_name FROM Movies ",con)

   budget belongs_to_collection_name
0   300.0    The Avengers Collection

3.1. Mencari 5 budget tertinggi berdasarkan kepimilikan film

In [110]:
pd.read_sql("SELECT max(budget) as budget,belongs_to_collection_name FROM Movies GROUP BY belongs_to_collection_name \
            ORDER BY budget DESC LIMIT 5 ",con)

   budget belongs_to_collection_name
0   300.0    The Avengers Collection
1   250.0                       None
2   200.0   Black Panther Collection
3   170.0   Jurassic Park Collection
4   150.0         The Meg Collection

----